// eslint-disable-next-line no-unused-vars
import SelectionTree from '@/modules/SelectionTree'

export default class DiagnosisTree extends SelectionTree {
  constructor () {
    super({
      腹腔鏡: {
        子宮: [
          '子宮内膜症(チョコレート嚢胞含む)',
          '異所性妊娠',
          '付属器癒着',
          '機能性不妊症(腹腔内検査)',
          '子宮筋腫',
          '子宮腺筋症',
          '子宮奇形',
          '骨盤臓器脱',
          '骨盤腹膜炎'
        ],
        付属器: [
          '子宮内膜症(チョコレート嚢胞含む)',
          '良性卵巣腫瘍',
          '多嚢胞性卵巣症候群',
          '異所性妊娠',
          '卵管閉塞・卵管留水(血)症',
          '付属器癒着',
          '卵巣出血',
          '機能性不妊症(腹腔内検査)',
          '上記以外の付属器良性疾患'
        ],
        その他: [
          '子宮内膜症(チョコレート嚢胞含む)',
          '異所性妊娠',
          '付属器癒着',
          '機能性不妊症(腹腔内検査)',
          '子宮筋腫',
          '先天性腟欠損症',
          '骨盤臓器脱',
          '骨盤腹膜炎'
        ]
      },
      腹腔鏡悪性: {
        子宮: [
          '子宮頸部前癌病変(CIN、CIS、AIS)',
          '子宮頸癌',
          '子宮体部前癌病変(子宮内膜異型増殖症)',
          '子宮体癌',
          '予防的内性器摘出術適応',
          '上記以外の子宮頸部腫瘍(子宮頸部嚢胞性病変、LEGH等)',
          '上記以外の子宮体部腫瘍(APAM、STUMP等)',
          '術後合併症の修復'
        ],
        付属器: [
          '境界悪性卵巣腫瘍',
          '卵巣癌(卵管癌・腹膜癌含む)',
          '予防的内性器摘出術適応',
          '妊孕性温存のための卵巣摘出',
          '転移性卵巣癌',
          '術後合併症の修復'
        ],
        その他: [
          '上記以外の悪性腫瘍',
          '術後合併症の修復'
        ]
      },
      子宮鏡: {
        子宮: [
          '子宮粘膜下筋腫',
          '子宮内膜ポリープ',
          'アッシャーマン症候群',
          '子宮腟異物',
          '子宮奇形',
          '過多月経',
          '子宮頸管ポリープ',
          '子宮体部前癌病変',
          '胎盤ポリープ・胎盤違残',
          '異所性妊娠',
          '上記以外の子宮体部腫瘍',
          '帝王切開瘢痕部症候群',
          '上記以外の子宮頸部腫瘍'
        ]
      },
      卵管鏡: {
        卵管: [
          '卵管閉鎖',
          '卵管狭窄',
          '卵管留水(血)症',
          '機能性不妊'
        ]
      }
    })
  }
}
