export default function ProcedureTimeSelections () {
  return [
    '30分まで',
    '30分以上 － 60分まで',
    '60分以上 － 90分まで',
    '90分以上 － 120分まで',
    '120分以上 － 150分まで',
    '150分以上 － 180分まで',
    '180分以上 － 210分まで',
    '210分以上 － 240分まで',
    '240分以上 － 270分まで',
    '270分以上 － 300分まで',
    '300分以上 － 330分まで',
    '330分以上 － 360分まで',
    '360分以上 － 420分まで',
    '420分以上 － 480分まで',
    '450分以上 － 480分まで',
    '480分以上 － 540分まで',
    '540分以上 － 600分まで',
    '600分以上 － 660分まで',
    '660分以上 － 720分まで',
    '720分以上'
  ]
}
